#### Terraform Plan ('src/domains/cgn/prod') 📖
<details>
<summary>Terraform Plan</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cosmos.module.cosmos_account_cgn.azurerm_cosmosdb_account.this has changed
  ~ resource "azurerm_cosmosdb_account" "this" {
        id                                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-cgn"
        name                                     = "io-p-cosmos-cgn"
      ~ read_endpoints                           = [
          - "https://io-p-cosmos-cgn-westeurope.documents.azure.com:443/",
            "https://io-p-cosmos-cgn-italynorth.documents.azure.com:443/",
          + "https://io-p-cosmos-cgn-westeurope.documents.azure.com:443/",
          + "https://io-p-cosmos-cgn-spaincentral.documents.azure.com:443/",
        ]
        tags                                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
      ~ write_endpoints                          = [
          ~ "https://io-p-cosmos-cgn-westeurope.documents.azure.com:443/" -> "https://io-p-cosmos-cgn-italynorth.documents.azure.com:443/",
        ]
        # (28 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cosmos.azurerm_monitor_metric_alert.cosmos_cgn_throttling_alert will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "cosmos_cgn_throttling_alert" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Insights/metricAlerts/[CGN | io-p-cosmos-cgn] Throttling"
        name                     = "[CGN | io-p-cosmos-cgn] Throttling"
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-cgn",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cosmos.azurerm_private_endpoint.cosno_remote_content_itn must be replaced
-/+ resource "azurerm_private_endpoint" "cosno_remote_content_itn" {
      ~ custom_dns_configs            = [
          - {
              - fqdn         = "io-p-cosmos-cgn.documents.azure.com"
              - ip_addresses = [
                  - "10.20.2.111",
                ]
            },
          - {
              - fqdn         = "io-p-cosmos-cgn-westeurope.documents.azure.com"
              - ip_addresses = [
                  - "10.20.2.112",
                ]
            },
          - {
              - fqdn         = "io-p-cosmos-cgn-italynorth.documents.azure.com"
              - ip_addresses = [
                  - "10.20.2.113",
                ]
            },
        ] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-itn-cgn-cosno-pep-01" -> (known after apply)
        name                          = "io-p-itn-cgn-cosno-pep-01"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/networkInterfaces/io-p-itn-cgn-cosno-pep-01.nic.36499b7f-1fac-438b-9bf6-9253b0b83a73"
              - name = "io-p-itn-cgn-cosno-pep-01.nic.36499b7f-1fac-438b-9bf6-9253b0b83a73"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [] -> (known after apply)
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (4 unchanged attributes hidden)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com",
            ]
        }

      ~ private_service_connection {
            name                              = "io-p-itn-cgn-cosno-pep-01"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-cgn" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.20.2.111" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.cosmos.module.cosmos_account_cgn.azurerm_cosmosdb_account.this must be replaced
-/+ resource "azurerm_cosmosdb_account" "this" {
      ~ connection_strings                           = (sensitive value)
      ~ create_mode                                  = "Default" -> (known after apply)
      ~ enable_automatic_failover                    = false -> true
      ~ endpoint                                     = "https://io-p-cosmos-cgn.documents.azure.com:443/" -> (known after apply)
      ~ id                                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-cgn" -> (known after apply)
      ~ location                                     = "westeurope" -> "italynorth" # forces replacement
      + mongo_server_version                         = (known after apply)
        name                                         = "io-p-cosmos-cgn"
      - network_acl_bypass_ids                       = [] -> null
      ~ primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      ~ primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      ~ primary_readonly_sql_connection_string       = (sensitive value)
      ~ primary_sql_connection_string                = (sensitive value)
      ~ read_endpoints                               = [
          - "https://io-p-cosmos-cgn-italynorth.documents.azure.com:443/",
          - "https://io-p-cosmos-cgn-westeurope.documents.azure.com:443/",
          - "https://io-p-cosmos-cgn-spaincentral.documents.azure.com:443/",
        ] -> (known after apply)
      ~ secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      ~ secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      ~ secondary_readonly_sql_connection_string     = (sensitive value)
      ~ secondary_sql_connection_string              = (sensitive value)
        tags                                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
      ~ write_endpoints                              = [
          - "https://io-p-cosmos-cgn-italynorth.documents.azure.com:443/",
        ] -> (known after apply)
        # (14 unchanged attributes hidden)

      ~ analytical_storage (known after apply)
      - analytical_storage {
            # (1 unchanged attribute hidden)
        }

      ~ backup {
          ~ interval_in_minutes = 0 -> (known after apply)
          ~ retention_in_hours  = 0 -> (known after apply)
          + storage_redundancy  = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ capabilities (known after apply)

      ~ capacity (known after apply)

      ~ consistency_policy {
          - max_interval_in_seconds = 5 -> null
          - max_staleness_prefix    = 100 -> null
            # (1 unchanged attribute hidden)
        }

      - geo_location {
          - failover_priority = 0 -> null
          - id                = "io-p-cosmos-cgn-italynorth" -> null
          - location          = "italynorth" -> null
          - zone_redundant    = true -> null
        }
      - geo_location {
          - failover_priority = 1 -> null
          - id                = "io-p-cosmos-cgn-westeurope" -> null
          - location          = "westeurope" -> null
          - zone_redundant    = false -> null
        }
      - geo_location {
          - failover_priority = 2 -> null
          - id                = "io-p-cosmos-cgn-spaincentral" -> null
          - location          = "spaincentral" -> null
          - zone_redundant    = false -> null
        }
      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "italynorth"
          + zone_redundant    = true
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "spaincentral"
          + zone_redundant    = false
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "7bc4b2e1-76c1-4fe4-b092-ecc1ef2299ad" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.cosmos.module.cosmos_account_cgn.azurerm_monitor_metric_alert.cosmos_db_provisioned_throughput_exceeded[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "cosmos_db_provisioned_throughput_exceeded" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Insights/metricAlerts/[CGN | io-p-cosmos-cgn] Provisioned Throughput Exceeded"
        name                     = "[CGN | io-p-cosmos-cgn] Provisioned Throughput Exceeded"
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-cgn",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (9 unchanged attributes hidden)

      ~ criteria {
            # (6 unchanged attributes hidden)

          ~ dimension {
                name     = "Region"
              ~ values   = [
                  ~ "westeurope" -> "italynorth",
                ]
                # (1 unchanged attribute hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.cosmos.module.cosmos_account_cgn.azurerm_private_endpoint.sql[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_private_endpoint" "sql" {
      - custom_dns_configs            = [] -> null
      - id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-cosmos-cgn-sql-endpoint" -> null
      - location                      = "westeurope" -> null
      - name                          = "io-p-cosmos-cgn-sql-endpoint" -> null
      - network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/networkInterfaces/io-p-cosmos-cgn-sql-endpoint.nic.cae72dc9-951f-46c8-8d63-3bcf66c68d0e"
              - name = "io-p-cosmos-cgn-sql-endpoint.nic.cae72dc9-951f-46c8-8d63-3bcf66c68d0e"
            },
        ] -> null
      - private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-cosmos-cgn-sql-endpoint/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.documents.azure.com"
              - name                = "privatelink.documents.azure.com"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com"
              - record_sets         = [
                  - {
                      - fqdn         = "io-p-cosmos-cgn.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.0.240.7",
                        ]
                      - name         = "io-p-cosmos-cgn"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "io-p-cosmos-cgn-westeurope.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.0.240.8",
                        ]
                      - name         = "io-p-cosmos-cgn-westeurope"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "io-p-cosmos-cgn-italynorth.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.0.240.53",
                        ]
                      - name         = "io-p-cosmos-cgn-italynorth"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name           = "io-p-rg-cgn" -> null
      - subnet_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/pendpoints" -> null
      - tags                          = {} -> null
        # (1 unchanged attribute hidden)

      - private_dns_zone_group {
          - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-cosmos-cgn-sql-endpoint/privateDnsZoneGroups/private-dns-zone-group" -> null
          - name                 = "private-dns-zone-group" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection              = false -> null
          - name                              = "io-p-cosmos-cgn-sql-endpoint" -> null
          - private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-cgn" -> null
          - private_ip_address                = "10.0.240.7" -> null
          - subresource_names                 = [
              - "Sql",
            ] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.functions.module.function_cgn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          - "AzureWebJobs.ContinueEycaActivation.Disabled"    = "0"
          - "AzureWebJobs.UpdateExpiredCgn.Disabled"          = "1"
          - "AzureWebJobs.UpdateExpiredEyca.Disabled"         = "1"
          - "CGN_CARDS_DATA_BACKUP_CONTAINER_NAME"            = "cgn-legalbackup-blob"
          - "CGN_CARDS_DATA_BACKUP_FOLDER_NAME"               = "cgn"
          - "CGN_DATA_BACKUP_CONNECTION"                      = (sensitive value)
          - "CGN_EXPIRATION_TABLE_NAME"                       = "cardexpiration"
          - "CGN_SERVICE_ID"                                  = (sensitive value)
          - "CGN_STORAGE_CONNECTION_STRING"                   = (sensitive value)
          - "CGN_UPPER_BOUND_AGE"                             = "36"
          - "COSMOSDB_CGN_DATABASE_NAME"                      = "db"
          - "COSMOSDB_CGN_KEY"                                = (sensitive value)
          - "COSMOSDB_CGN_URI"                                = (sensitive value)
          - "COSMOSDB_CONNECTION_STRING"                      = (sensitive value)
          - "DURABLE_FUNCTION_STORAGE_CONNECTION_STRING"      = (sensitive value)
          - "EYCA_API_BASE_URL"                               = "https://ccdb.eyca.org/api"
          - "EYCA_API_PASSWORD"                               = (sensitive value)
          - "EYCA_API_USERNAME"                               = (sensitive value)
          - "EYCA_EXPIRATION_TABLE_NAME"                      = "eycacardexpiration"
          - "EYCA_UPPER_BOUND_AGE"                            = "31"
          - "FETCH_KEEPALIVE_ENABLED"                         = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                        = "node"
          - "INTERNAL_STORAGE_CONNECTION_STRING"              = (sensitive value)
          - "NODE_ENV"                                        = "production"
          - "OTP_TTL_IN_SECONDS"                              = "600"
          - "REDIS_PASSWORD"                                  = (sensitive value)
          - "REDIS_PORT"                                      = (sensitive value)
          - "REDIS_URL"                                       = (sensitive value)
          - "SERVICES_API_KEY"                                = (sensitive value)
          - "SERVICES_API_URL"                                = "http://api-app.internal.io.pagopa.it/"
          - "SLOT_TASK_HUBNAME"                               = "ProductionTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
          - "WEBSITE_TIME_ZONE"                               = "Central Europe Standard Time"
        } -> (known after apply)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Web/sites/io-p-cgn-fn"
        name                                           = "io-p-cgn-fn"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Enti & Servizi"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.module.function_cgn_merchant.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          - "CGN_STORAGE_CONNECTION_STRING"                   = (sensitive value)
          - "COSMOSDB_CGN_DATABASE_NAME"                      = "db"
          - "COSMOSDB_CGN_KEY"                                = (sensitive value)
          - "COSMOSDB_CGN_URI"                                = (sensitive value)
          - "COSMOSDB_CONNECTION_STRING"                      = (sensitive value)
          - "FETCH_KEEPALIVE_ENABLED"                         = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                        = "node"
          - "NODE_ENV"                                        = "production"
          - "REDIS_PASSWORD"                                  = (sensitive value)
          - "REDIS_PORT"                                      = (sensitive value)
          - "REDIS_URL"                                       = (sensitive value)
          - "SLOT_TASK_HUBNAME"                               = "ProductionTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        } -> (known after apply)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Web/sites/io-p-cgn-merchant-fn"
        name                                           = "io-p-cgn-merchant-fn"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.module.function_cgn_merchant_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          - "CGN_STORAGE_CONNECTION_STRING"                   = (sensitive value)
          - "COSMOSDB_CGN_DATABASE_NAME"                      = "db"
          - "COSMOSDB_CGN_KEY"                                = (sensitive value)
          - "COSMOSDB_CGN_URI"                                = (sensitive value)
          - "COSMOSDB_CONNECTION_STRING"                      = (sensitive value)
          - "FETCH_KEEPALIVE_ENABLED"                         = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                        = "node"
          - "NODE_ENV"                                        = "production"
          - "REDIS_PASSWORD"                                  = (sensitive value)
          - "REDIS_PORT"                                      = (sensitive value)
          - "REDIS_URL"                                       = (sensitive value)
          - "SLOT_TASK_HUBNAME"                               = "StagingTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        } -> (known after apply)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Web/sites/io-p-cgn-merchant-fn/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.module.function_cgn_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          - "AzureWebJobs.ContinueEycaActivation.Disabled"    = "1"
          - "AzureWebJobs.UpdateExpiredCgn.Disabled"          = "1"
          - "AzureWebJobs.UpdateExpiredEyca.Disabled"         = "1"
          - "CGN_CARDS_DATA_BACKUP_CONTAINER_NAME"            = "cgn-legalbackup-blob"
          - "CGN_CARDS_DATA_BACKUP_FOLDER_NAME"               = "cgn"
          - "CGN_DATA_BACKUP_CONNECTION"                      = (sensitive value)
          - "CGN_EXPIRATION_TABLE_NAME"                       = "cardexpiration"
          - "CGN_SERVICE_ID"                                  = (sensitive value)
          - "CGN_STORAGE_CONNECTION_STRING"                   = (sensitive value)
          - "CGN_UPPER_BOUND_AGE"                             = "36"
          - "COSMOSDB_CGN_DATABASE_NAME"                      = "db"
          - "COSMOSDB_CGN_KEY"                                = (sensitive value)
          - "COSMOSDB_CGN_URI"                                = (sensitive value)
          - "COSMOSDB_CONNECTION_STRING"                      = (sensitive value)
          - "DURABLE_FUNCTION_STORAGE_CONNECTION_STRING"      = (sensitive value)
          - "EYCA_API_BASE_URL"                               = "https://ccdb.eyca.org/api"
          - "EYCA_API_PASSWORD"                               = (sensitive value)
          - "EYCA_API_USERNAME"                               = (sensitive value)
          - "EYCA_EXPIRATION_TABLE_NAME"                      = "eycacardexpiration"
          - "EYCA_UPPER_BOUND_AGE"                            = "31"
          - "FETCH_KEEPALIVE_ENABLED"                         = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                        = "node"
          - "INTERNAL_STORAGE_CONNECTION_STRING"              = (sensitive value)
          - "NODE_ENV"                                        = "production"
          - "OTP_TTL_IN_SECONDS"                              = "600"
          - "REDIS_PASSWORD"                                  = (sensitive value)
          - "REDIS_PORT"                                      = (sensitive value)
          - "REDIS_URL"                                       = (sensitive value)
          - "SERVICES_API_KEY"                                = (sensitive value)
          - "SERVICES_API_URL"                                = "http://api-app.internal.io.pagopa.it/"
          - "SLOT_TASK_HUBNAME"                               = "StagingTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
          - "WEBSITE_TIME_ZONE"                               = "Central Europe Standard Time"
        } -> (known after apply)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Web/sites/io-p-cgn-fn/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 6 to change, 3 to destroy.

Changes to Outputs:
  ~ cosmos_cgn                   = {
      ~ id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-cgn" -> (known after apply)
        name = "io-p-cosmos-cgn"
    }

Warning: Deprecated Resource

  with module.functions.azurerm_app_service_plan.app_service_plan_cgn_common,
  on ../_modules/functions_apps/app_service_plan_cgn_common.tf line 1, in resource "azurerm_app_service_plan" "app_service_plan_cgn_common":
   1: resource "azurerm_app_service_plan" "app_service_plan_cgn_common" {

The `azurerm_app_service_plan` resource has been superseded by the
`azurerm_service_plan` resource. Whilst this resource will continue to be
available in the 2.x and 3.x releases it is feature-frozen for compatibility
purposes, will no longer receive any updates and will be removed in a future
major release of the Azure Provider.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
